--------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\fertility-data\fertility-replication-sept-revision\output\logs\fig_2d.log
  log type:  text
 opened on:  15 Sep 2021, 01:51:03

. 
. tempfile temp1

. tempfile temp2

. tempfile temp3

. tempfile temp4

. 
. ******* (1/3) Numerator: Births, 20-44 by Educ Level ********
. *From NCHS Natality Microdata
. use $ft_data_dir\nchs\nchs_births_pop_1990_2019, clear

. drop if inlist(stname,"AB","BC","MB","NB","NS","ON","QC","SK","XX")
(0 observations deleted)

. 
. gen numbirthalleduc = numbirth_lesshs + numbirth_hsgrad + numbirth_somecoll + numbirth_colgrad +
>  numbirth_educ_miss

. gen numbirth_witheduc = numbirth_lesshs + numbirth_hsgrad + numbirth_somecoll + numbirth_colgrad
>  

. 
. collapse (sum) numbirth_lesshs numbirth_hsgrad numbirth_somecoll ///
>  numbirth_colgrad numbirthalleduc numbirth_witheduc, by(year)

. 
. save `temp1'
file C:\Users\luke.pardue\AppData\Local\Temp\ST_00000001.tmp saved

. 
. 
. ******* (2/3) Denominator: Pop 20-44 By Educ Level ********
. 
. *USE CPS 1990-2019 (Hispanic Origin Only Recorded 1994-)
. use $ft_data_dir\educ\cps_19902019, clear

. 
. *drop health insurance supplement in 2014
. drop if hflag==1
(60141 observations deleted)

. 
. *keep only females
. drop if sex==1
(2683163 observations deleted)

. 
. *keep 20-44
. drop if age<20 | age>44
(1855986 observations deleted)

. 
. *education codes
. gen edgrp = ""
(1001094 missing values generated)

. replace edgrp = "lesshs" if educ<=71 // includes 12 grades 1992 recode
edgrp was str1 now str6
(109896 real changes made)

. replace edgrp = "hsgrad" if educ>=72 & educ<=73
(287731 real changes made)

. replace edgrp = "somecoll" if educ>=80 & educ<=100
edgrp was str6 now str8
(319301 real changes made)

. replace edgrp = "colgrad" if educ>100
(284166 real changes made)

. assert edgrp!= ""

. 
. *education codes
. gen agegrp = ""
(1001094 missing values generated)

. replace agegrp = "1519" if age<=19 
(0 real changes made)

. replace agegrp = "2024" if age>19 & age<=24
agegrp was str1 now str4
(169997 real changes made)

. replace agegrp = "2534" if age>24 & age<=34
(394891 real changes made)

. replace agegrp = "3544" if age>34
(436206 real changes made)

. assert agegrp!= ""

. 
. *education codes 6 grps  
. gen agegrp6 = ""
(1001094 missing values generated)

. replace agegrp6 = "1519" if age<=19 
(0 real changes made)

. replace agegrp6 = "2024" if age>19 & age<=24
agegrp6 was str1 now str4
(169997 real changes made)

. replace agegrp6 = "2529" if age>24 & age<=29
(186476 real changes made)

. replace agegrp6 = "3034" if age>29 & age<=34
(208415 real changes made)

. replace agegrp6 = "3539" if age>34 & age<=39
(218449 real changes made)

. replace agegrp6 = "4044" if age>39
(217757 real changes made)

. assert agegrp6!= ""

. 
. *collapse to number by state-year 
. collapse (sum) pop=asecwt, by(state year edgrp)

. 
. *get state abbreviation to merge
. statastates, fips(statefip)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             6,324  (_merge==3)
    -----------------------------------------

. drop _merge state_name statefip

. rename state_abbrev stname

. 
. *reshape wide 
. reshape wide pop, i(year stname) j(edgrp) string
(note: j = colgrad hsgrad lesshs somecoll)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                     6324   ->    1581
Number of variables                   4   ->       6
j variable (4 values)             edgrp   ->   (dropped)
xij variables:
                                    pop   ->   popcolgrad pophsgrad ... popsomecoll
-----------------------------------------------------------------------------

. 
. gen total = poplesshs + pophsgrad + popsomecoll + popcolgrad

. foreach var in lesshs hsgrad somecoll colgrad{
  2. gen pct_`var'  = pop`var'/total
  3. }

. rename pop* pop*_cps 

. 
. merge 1:1 stname year using $ft_data_dir\pop\age_race_comp_seer.dta , keepusing(pop1519 pop2034 
> pop3544)

    Result                           # of obs.
    -----------------------------------------
    not matched                            51
        from master                        51  (_merge==1)
        from using                          0  (_merge==2)

    matched                             1,530  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(51 observations deleted)

. drop _merge 

. 
. gen pop2044 = pop2034 + pop3544

. keep stname year pct* *_cps pop2044

. 
. foreach var in lesshs hsgrad somecoll colgrad{
  2. gen pop_`var'_seer  = pct_`var'*pop2044
  3. }

. 
. keep stname year pop* 

. 
. drop if year<1992 | year>2019
(102 observations deleted)

. *save $data_dir\decomp\state_year_educ_pop, replace
. 
. *cap drop _merge
. *use $data_dir\decomp\state_year_educ_pop
. *assert _merge==3
. *drop _merge 
. 
. *use cps vars for population count
. rename poplesshs_cps poplesshs

. rename pophsgrad_cps pophsgrad

. rename popsomecoll_cps popsomecoll

. rename popcolgrad_cps popcolgrad

. sum poplesshs pophsgrad popsomecoll popcolgrad 

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
   poplesshs |      1428    105912.5    173107.3    1744.23    1256673
   pophsgrad |      1428      281639    300561.2   17425.07    1746606
 popsomecoll |      1428      330329    374825.5   18678.29    2290125
  popcolgrad |      1428    297170.7    351546.3   11123.49    2637760

. 
. 
. *gen popalleduc = pop2044
. gen popalleduc = poplesshs + pophsgrad + popsomecoll + popcolgrad

. 
. ********* EDUCATION IMPUTATION *********
. 
. *Collapse by population
. collapse (sum) poplesshs pophsgrad popsomecol popcolgrad popalleduc, by(year)

. 
. *merge in births data
. merge 1:1 year using `temp1'

    Result                           # of obs.
    -----------------------------------------
    not matched                             2
        from master                         0  (_merge==1)
        from using                          2  (_merge==2)

    matched                                28  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(2 observations deleted)

. drop _merge

.          
.         *Reallocate births with missing educ according to nonmissing national distribution
.         foreach var in lesshs hsgrad somecoll colgrad {
  2.         gen pct_`var' = (numbirth_`var'/numbirthalleduc)
  3.         gen pct_nonmissing_`var' = (numbirth_`var'/numbirth_witheduc)
  4.         gen numbirth`var' = numbirthalleduc*pct_nonmissing_`var' 
  5.         }

.         *rename popsomecol popsomecoll
.         drop numbirth_* numbirthalleduc pct* popalleduc

.         
.         foreach var in lesshs hsgrad somecoll colgrad {
  2.         gen brate_`var' = numbirth`var'/pop`var'*1000
  3.         }

.         
.         keep year brate_*

. 
. twoway line brate_lesshs brate_hsgrad brate_somecoll brate_colgrad year
(note: scheme plain not found, using s2color)

. 
. graph export $ft_output_dir/fig_2d.png, replace
(file D:\fertility-data\fertility-replication-sept-revision\output/fig_2d.png written in PNG forma
> t)

. 
. export delimited $ft_output_dir/fig_2d.csv, replace 
file D:\fertility-data\fertility-replication-sept-revision\output/fig_2d.csv saved

.         
. cap log close
