--------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\fertility-data\fertility-replication-sept-revision\output\logs\figs_2a_2b.log
  log type:  text
 opened on:  15 Sep 2021, 01:50:30

. 
. *Data Work, Merge All Sources Together:
. import delimited $ft_data_dir\figs_2a_2b.csv, clear
(10 vars, 41 obs)
. 
. destring *, replace
year already numeric; no replace
brate_1519 already numeric; no replace
brate_2024 already numeric; no replace
brate_2529 already numeric; no replace
brate_3034 already numeric; no replace
brate_3539 already numeric; no replace
brate_4044 already numeric; no replace
brate_whitenh already numeric; no replace
brate_blacknh already numeric; no replace
brate_hisp already numeric; no replace

. 
. *Figure 2a - Mother's 5-yr age groups
. twoway line brate_1519 brate_2024 brate_2529 brate_3034 brate_3539 brate_4044 year
(note: scheme plain not found, using s2color)

. 
. graph export $ft_output_dir/fig_2a.png, replace
(file D:\fertility-data\fertility-replication-sept-revision\output/fig_2a.png written in PNG forma
> t)

. 
. *Figure 2b - Mother's Race/Ethnicity
. twoway line brate_whitenh brate_blacknh brate_hisp year if year>=1990
(note: scheme plain not found, using s2color)

. 
. graph export $ft_output_dir/fig_2b.png, replace
(file D:\fertility-data\fertility-replication-sept-revision\output/fig_2b.png written in PNG forma
> t)

. 
. 
. log close
      name:  <unnamed>
       log:  D:\fertility-data\fertility-replication-sept-revision\output\logs\figs_2a_2b.log
  log type:  text
 closed on:  15 Sep 2021, 01:50:33
--------------------------------------------------------------------------------------------------
